#Прямий пошук підрядка.
while True:
    text=input('Введіть текст: ')
    print(text)
    pattern=input('Введіть підрядок: ')
    print(pattern)

    i=-1 #індекс рядка.
    j=0 #індекс підрядка.
    counter=0 #лічильник

    while (j<len(pattern)) and i<(len(text)-len(pattern)):
        j=0
        i+=1
        counter+=1
        while j<len(pattern) and pattern[j]==text[i+j]:
            j+=1
    if (j==len(pattern)):
        print(f'Підрядок знайдений у позиції {i} за {counter} зміщень.')
    else:
        print('Підрядок не знайдено.')


    result=input('Input "1" to continue, and other to exit: ')
    if result=='1':
        continue
    break

    '''
    Прграма працює таким чином: пошук підрядка у рядку відбувається за допомогою
    індекса i. Кожного разу, на одному циклі відбувається перевірка (зіставлення
    нулевого символу підрядка з нулевим символом рядка, перший з першим і тд). Це
    відбувається до тих пір, поки не буде знайдена повна копія підрядка з рядком.
    Якщо довжина підрядка на певній ітеарції буде уже більшою, ніж довжина рядка,
    то підрядок не буде знайдений.
    '''
    #Перевірку на не входження підрядка у рядок також можна перевірити у цій \
    #програмі. Наприклад, дано рядок : "This flower is beautiful" та підрядок: \
    # "flowers". Виконується перше порівняння нулевих елементів - не співпало.\
    #Відразу дійдемо до моменту, де будуть порівнюватися "flower" з "flowers".\
    #Усі літери слова дійсно співпадають, але програма видасть else: Підрядок не\
    #знайдено, оскільки остання літера підрядка "flowers" не буде співпадати з \
    #останнім символом слова "flower" нашого рядка (оскільки там пробіл).

    

