#виведіть на екран транспоновану матрицю 3*3 (початкова матриця задана \
#користувачем)
import numpy as np #Імпортуємо бібліотеку NumPy.
while True:
    while True:
        try:
            #Розмірність матриці.
            n,m=int(input('Введіть кількість рядків: ')),\
                int(input('Введіть кількість стовпчиків: '))

            A=np.zeros((n,m), dtype=int) #Ініціалізуємо матрицю (поки нулями)
            if n==3 and m==3: #Перевірка, чи користувач задав розміри 3 на 3.
                for i in range(n): #Ввійдемо у послідовність циклу рядків.
                    for j in range(m): #Аналогічно зі стовпчиками.
                        #Для кожного індексу матриці будемо вводити значення.
                        A[i,j]=int(input(f' [{i+1}, {j+1}]: '))
            #Виведемо звичайну матрицю для зручності, пізніше - транспоновану.
                print('Ваша матриця: ', A)
            break

        except ValueError: #Якщо не числа, а щось інше - ПОМИЛКА!
            print('Введіть числа! ')


    T = np.zeros((n, m), dtype=int)#Ініціалізуємо нулеву матрицю.
    for i in range(m):#У цьому циклі ми отримаємо транспоновану матрицю.
        for j in range(n):
            T[i,j]=A[j,i]#Надамо значення транспонованої матриці нулевій (T).
            #Тепер матриця "Т" - транспонована.
    print('Транспонована матриця: ', T)
            
#Саме перестановкою індексів ми отримаємо транспоновану матрицю. Наприклад, \
#число "2" розміщене на позиції [0,1], а при транспонуванні вже на [1,0].\
#Неважко помітити, як саме у нас змінилися індекси, а саме: A[i,j] на A[j,i].


    #Повторити результат виконання програми?
    result=input('Input "1" to continue, and other to exit: ')
    if result=='1':
        continue
    break
