#1.3 (1) виведіть на екран елементи лінійного масиву (заданий користувачем) у \
#зворотному порядку

import numpy as np #Імпортуємо бібліотеку numpy.
while True:
    while True:
        try:
#Користувач вводить масив та "розвертаємо" його за допомогою зрізу [::-1]
            A = np.array(list(map(int, input('Введіть лінійний масив: ').split())))[::-1] 
            print(A)
            break

        except ValueError: #Перевіряємо чи користувач ввів числа, чи щось інше.
            print('Введіть послідовність чисел!')


    result = input('Хочете запустити заново? Якщо так - 1, ні - інше: ')
    if result == '1':
        continue
    else:
        break
            

    
